{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Blog",
  "home_page_url": "https://heeiya.github.io/KDEBlog/",
  "feed_url": "https://heeiya.github.io/KDEBlog/feed.json",
  "description": "A blog now mainly about my particpation in OSPP with KDE ",
  "icon": "https://avatars.githubusercontent.com/u/90752469?s=400&u=69796f3c09ffaa19d5dc128699599458dadb5d14&v=4",
  "items": [
    {
      "title": "Building and Running QML Android Applications",
      "url": "https://heeiya.github.io/KDEBlog/posts/QML%20%E5%AE%89%E5%8D%93%E5%BA%94%E7%94%A8%E6%9E%84%E5%BB%BA%E4%B8%8E%E8%BF%90%E8%A1%8C.html",
      "id": "https://heeiya.github.io/KDEBlog/posts/QML%20%E5%AE%89%E5%8D%93%E5%BA%94%E7%94%A8%E6%9E%84%E5%BB%BA%E4%B8%8E%E8%BF%90%E8%A1%8C.html",
      "summary": "Building and Running QML Android Applications\nBuilding QML Android Applications\nQt Creator uses Gradle for project building. Once your project code is ready, select the Android ...",
      "content_html": "\n<h2>Building QML Android Applications</h2>\n<p>Qt Creator uses Gradle for project building. Once your project code is ready, select the Android kit for building in Qt Creator. Click build, and Qt Creator will generate Gradle configuration files for you. However, you may encounter errors such as:</p>\n<blockquote>\n<p>Execution failed for task ':processDebugResources'.\nA failure occurred while executing com.android.build.gradle.internal.res.LinkApplicationAndroidResourcesTask$TaskAction\nAndroid resource linking failed\naapt2 E 07-23 15:59:44 51907 51907 LoadedArsc.cpp:94] RES_TABLE_TYPE_TYPE entry offsets overlap actual entry data.\naapt2 E 07-23 15:59:44 51907 51907 ApkAssets.cpp:149] Failed to load resources table in APK '/home/zhy/Android/Sdk/platforms/android-35/android.jar'.</p>\n</blockquote>\n<p>This is because the current Gradle plugin version does not support android-35. See<a href=\"https://stackoverflow.com/questions/54152209/how-to-fix-execution-failed-for-task-appprocessdebugresources-android-re\" target=\"_blank\" rel=\"noopener noreferrer\">How to fix \"Execution failed for task ':app:processDebugResources'. &gt; Android resource linking failed\"[Android/Flutter] - Stack Overflow</a></p>\n<p>To resolve this issue, you need to modify the Gradle configuration.</p>\n<p>Navigate to the <code>/build/Qt_6_7_2_Clang_arm64_v8a-Debug/android-build</code> folder in your project.</p>\n<p>Open the <code>build.gradle</code> file and locate the <code>dependencies</code> block:</p>\n<div class=\"language-text\" data-highlighter=\"prismjs\" data-ext=\"text\" data-title=\"text\"><pre class=\"language-text\"><code><span class=\"line\">dependencies {</span>\n<span class=\"line\">        classpath 'com.android.tools.build:gradle:7.4.1'</span>\n<span class=\"line\">    }</span>\n<span class=\"line\"></span>\n<span class=\"line\"></span></code></pre></div><p><code>com.android.tools.build:gradle:7.4.1</code> refers to the Android Gradle Plugin (AGP). This default version is from 2022 and is quite outdated.</p>\n<p>You can find the latest version here: <a href=\"https://mvnrepository.com/artifact/com.android.tools.build/gradle?repo=google\" target=\"_blank\" rel=\"noopener noreferrer\">Maven Repository: com.android.tools.build » gradle</a></p>\n<p>Update the plugin version to a newer one, for example:</p>\n<div class=\"language-text\" data-highlighter=\"prismjs\" data-ext=\"text\" data-title=\"text\"><pre class=\"language-text\"><code><span class=\"line\">    dependencies {</span>\n<span class=\"line\">        classpath 'com.android.tools.build:gradle:8.4.1'</span>\n<span class=\"line\">    }</span>\n<span class=\"line\"></span></code></pre></div><p>Additionally, when upgrading the plugin version, ensure compatibility with the <a href=\"https://gradle.org/releases/\" target=\"_blank\" rel=\"noopener noreferrer\">Gradle version</a>.</p>\n<p>Check the relationship between the Gradle and AGP versions here: <a href=\"https://developer.android.com/build/releases/gradle-plugin#updating-gradle\" target=\"_blank\" rel=\"noopener noreferrer\">Android Gradle plugin 8.5 release notes | Android Studio | Android Developers</a></p>\n<blockquote>\n<p>Reference: <a href=\"https://stackoverflow.com/questions/70545646/could-not-find-com-android-tools-buildgradle7-3-3-error-found-in-build-gradle\" target=\"_blank\" rel=\"noopener noreferrer\">Could not find com.android.tools.build:gradle:7.3.3. error found in build.gradle file - Stack Overflow</a></p>\n</blockquote>\n<p>Therefore, you should use at least Gradle version 8.6 to support this plugin.</p>\n<p>Navigate to the <code>./gradle/wrapper</code> folder and open the <code>gradle-wrapper.properties</code> file. This file defines the Gradle version used by the project.</p>\n<p>Find the line:\n<code>distributionUrl=https\\://services.gradle.org/distributions/gradle-8.3-bin.zip</code></p>\n<p>Change it to:</p>\n<p><code>distributionUrl=https\\://services.gradle.org/distributions/gradle-8.6-bin.zip</code></p>\n<p>This update specifies that the project will use Gradle version 8.6.</p>\n<p>After making these changes, click on build. It will automatically download the specified version of Gradle and then download the necessary Gradle plugins.</p>\n<p>If successful, you can find the built APK at <code>./build/outputs/apk/debug</code>.</p>\n<h2>Running and Installing APK</h2>\n<p>In a Linux environment, you can use the adb command to install the APK on your Android device. Alternatively, you can use Qt Creator for one-click deployment.</p>\n<p>After connecting your Android device via USB, use the adb command to install the APK:</p>\n<div class=\"language-bash\" data-highlighter=\"prismjs\" data-ext=\"sh\" data-title=\"sh\"><pre class=\"language-bash\"><code><span class=\"line\">adb <span class=\"token function\">install</span> android-build-debug.apk</span>\n<span class=\"line\"></span></code></pre></div><p>Make sure that your Android device has Developer Mode enabled. You can find specific instructions on how to enable Developer Mode based on your device model through an online search.</p>\n",
      "date_published": "2024-07-23T00:00:00.000Z",
      "date_modified": "2024-07-24T14:21:33.000Z",
      "authors": [],
      "tags": []
    },
    {
      "title": "Mid-Term Summary of 2024 OSPP KDE Project",
      "url": "https://heeiya.github.io/KDEBlog/posts/2024OSPP%20KDE%E9%A1%B9%E7%9B%AE%E4%B8%AD%E6%9C%9F%E6%80%BB%E7%BB%93.html",
      "id": "https://heeiya.github.io/KDEBlog/posts/2024OSPP%20KDE%E9%A1%B9%E7%9B%AE%E4%B8%AD%E6%9C%9F%E6%80%BB%E7%BB%93.html",
      "summary": "Mid-Term Summary of 2024 OSPP KDE Project\nIt has been three weeks since the start of the OSPP project, during which my project has made some progress.\nWeek 1, July 1st to July 7...",
      "content_html": "\n<p>It has been three weeks since the start of the OSPP project, during which my project has made some progress.</p>\n<h2>Week 1, July 1st to July 7th</h2>\n<p>In the first week of the project, with the help of my mentor, I first set up a suitable development environment and identified Blinken as the first application to be migrated for the project. In addition to this, I also set up this project's blog, which has now been included in KDE Planet.</p>\n<p>Currently, I am using a development environment on a VirtualBox virtual machine running Fedora Workstation 40. With this setup, I can compile and build KDE applications and perform Qt development.</p>\n<p>For building the KDE development environment, it is recommended to use<a href=\"https://develop.kde.org/docs/getting-started/building/kdesrc-build-setup/\" target=\"_blank\" rel=\"noopener noreferrer\">kdesrc-build</a> provided by KDE official, and it is also recommended to develop under KDE Neon system, which can be done using <a href=\"https://community.kde.org/Get_Involved/development/More#Develop_in_a_Linux_container\" target=\"_blank\" rel=\"noopener noreferrer\">docker</a> or <a href=\"https://community.kde.org/Get_Involved/development/Developing_in_a_virtual_machine\" target=\"_blank\" rel=\"noopener noreferrer\">virtual machines</a></p>\n<p>A straightforward method for setting up Qt Android development environment is to use[Qt Online Installer](<a href=\"https://doc.qt.io/qt-6/get-and-install-qt.html#using-qt-maintenance-tool\" target=\"_blank\" rel=\"noopener noreferrer\">Get and Install Qt | Qt 6.7</a>) and Qt Creator. After installing Qt Creator, navigate to Editing -&gt; Preferences -&gt; Devices -&gt; Android to select the necessary development kit. Qt Creator will automatically download the required SDK and NDK.</p>\n<h2>Week 2, July 8th to July 14th</h2>\n<p>Upon my mentor's suggestion, I developed a simple Tic-Tac-Toe QML game as a practice exercise. This game uses QML to create a simple interface and employs a C++ class to handle game logic, which will also be the architecture for the upcoming game migration.</p>\n<p>The current features implemented in the game are:</p>\n<ol>\n<li>Multilingual localization support</li>\n<li>Unit testing capability</li>\n<li>Cross-platform compatibility</li>\n</ol>\n<p>The Tic-Tac-Toe game has been open-sourced on KDE Invent: <a href=\"https://invent.kde.org/zhy/tictactoe\" target=\"_blank\" rel=\"noopener noreferrer\">hanyang zhang / TicTacToe · GitLab</a></p>\n<p>Supporting localization for QML applications requires the use of Qt's localization tools such as lupdate and lrelease. However, since the project is built with CMake, Qt also provides corresponding CMake methods: <a href=\"https://doc.qt.io/qt-6/qtlinguist-cmake-qt-add-translations.html\" target=\"_blank\" rel=\"noopener noreferrer\">qt_add_translations | Qt Linguist Manual</a></p>\n<p>Additionally, I encountered some difficulties while building QML Android applications, as described here:</p>\n<h2>Week 3, July 15th to July 21st</h2>\n<p>During this week, I officially began the migration work for Blinken.</p>\n<p>After studying Blinken's source code, I found that the interface of Blinken is drawn by a class named Blinken, which spans over 1000 lines. The drawing logic involves manipulating elements from Blinken.svg and using QPainter for direct drawing.</p>\n<p>Unfortunately, QML does not provide built-in support for manipulating SVG images like QtWidgets. Therefore, I split the SVG images into separate files and assembled these elements using QML.</p>\n<p></p>\n<p>Modifying the UI took longer than I anticipated. However, after a week, I have nearly completed the interface drawing for Blinken. Next steps involve refining some page details and migrating Blinken's logic over.</p>\n<p>It's worth mentioning that QML does not provide a non-rectangular MouseArea for use, requiring the creation of a custom class to achieve this functionality. Fortunately, an example for this existed in earlier versions of the documentation: <a href=\"https://code.qt.io/cgit/qt/qtdeclarative.git/tree/examples/quick/customitems/maskedmousearea?h=6.2\" target=\"_blank\" rel=\"noopener noreferrer\">maskedmousearea example</a>. Although this example seems to have been removed in the latest version, it should still be feasible to implement based on reference.</p>\n",
      "date_published": "2024-07-21T00:00:00.000Z",
      "date_modified": "2024-07-24T14:21:33.000Z",
      "authors": [],
      "tags": [
        "OSPP"
      ]
    },
    {
      "title": "2024OSPP KDE社区项目：Porting KDE Games to Android platform",
      "url": "https://heeiya.github.io/KDEBlog/posts/2024OSPP%20KDE%E7%A4%BE%E5%8C%BA%E9%A1%B9%E7%9B%AE%EF%BC%9APorting%20KDE%20Games%20to%20Android%20platform.html",
      "id": "https://heeiya.github.io/KDEBlog/posts/2024OSPP%20KDE%E7%A4%BE%E5%8C%BA%E9%A1%B9%E7%9B%AE%EF%BC%9APorting%20KDE%20Games%20to%20Android%20platform.html",
      "summary": "2024OSPP KDE社区项目：Porting KDE Games to Android platform\nDuring the 2024 Open Source Promotion Plan (OSPP) event, I had the honor of being selected for the KDE community project: ...",
      "content_html": "\n<p>During the 2024 Open Source Promotion Plan (OSPP) event, I had the honor of being selected for the KDE community project: Porting KDE Games to the Android platform. This is KDE community's first participation in OSPP, and it is their first and only project.</p>\n<img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/KDE_logo.svg/330px-KDE_logo.svg.png\">\n<p>About the KDE Community: <a href=\"https://userbase.kde.org/What_is_KDE/zh-cn\" target=\"_blank\" rel=\"noopener noreferrer\">What is KDE - KDE UserBase Wiki</a></p>\n<blockquote>\n<p>KDE is a large <strong>community</strong> of programmers, translators, contributors, artists, authors, distributors, and users from around the world, dedicated to creating the best free software for desktops. Users and fans of KDE software are also spread globally, helping each other, spreading community news, or just enjoying this wonderful experience.</p>\n</blockquote>\n<p><a href=\"https://kde.org/zh-cn/\" target=\"_blank\" rel=\"noopener noreferrer\">KDE community</a></p>\n<img src=\"https://summer-ospp.ac.cn/help/assets/logo.svg\">\n<p>About OSPP (Open Source Promotion Plan):</p>\n<blockquote>\n<p>The Open Source Promotion Plan is a summer open source event initiated and long-term supported by the \"<strong>Open Source Software Supply Chain Lighting Plan</strong>\". It aims to encourage students to actively participate in the development and maintenance of open source software, promote the vigorous development of outstanding open source software communities, and cultivate and discover more excellent developers. The event collaborates with major open source communities at home and abroad, providing project tasks for the development and maintenance of important open source software and is open to global college students for registration. <a href=\"https://summer-ospp.ac.cn/?lang=en\" target=\"_blank\" rel=\"noopener noreferrer\">Open Source Software Supply Chain Lighting Plan - OSPP 2024</a></p>\n</blockquote>\n<h2>Project Introduction</h2>\n<p>The description of the KDE project: <a href=\"https://summer-ospp.ac.cn/org/prodetail/24b5c0531?list=org&amp;navpage=org\" target=\"_blank\" rel=\"noopener noreferrer\">Porting KDE Games to Android platform</a> is as follows:</p>\n<blockquote>\n<p>KDE Games and educational games are integral parts of the KDE Gear suite. Very few applications are currently operational on platforms other than Linux, such as Android. The supported applications can be viewed at <a href=\"https://apps.kde.org/platforms/android\" target=\"_blank\" rel=\"noopener noreferrer\">https://apps.kde.org/platforms/android</a>. Consequently, we plan to port some of these games to Android, specifically supporting architectures like arm64-v8a, x86, and x86_64. The ultimate goal is to distribute their Android versions through apps.kde.org, F-Droid, Google Store, etc.</p>\n<p>Candidates for porting include Kajongg, KMahjongg, KShisen, Kigo, Blinken, Klickety, Skladnik, Kbounce, Kollision, KSudoku, KTurtle, Picmi, and Klines. You can learn about their features and code at apps.kde.org or invent.kde.org.</p>\n<p>Finally, you will port one or more of these games to Android and facilitate community efforts to distribute them through software stores.</p>\n</blockquote>\n<p>In simple terms, the project involves porting some KDE games to the Android platform, as these games are currently only available on the Linux platform. If you use Ubuntu, you can install and run a game with the following commands:</p>\n<ol>\n<li>sudo apt install Kollision</li>\n<li>kollision</li>\n</ol>\n<p>Available games include Kajongg, KMahjongg, KShisen, Kigo, Blinken, Klickety, Skladnik, Kbounce, Kollision, KSudoku, KTurtle, Picmi, and Klines. However, for the completion of the project, porting just one game is sufficient.</p>\n<h2>My Application Experience</h2>\n<p>When I first saw this project, it was quite late, with less than a week before the application deadline. Before that, I had already written an application for another project. However, after seeing this project, I felt it was more appealing to me. Unfortunately, at that time, I was preparing for an exam, so I had only two days left to write the application.</p>\n<p>After pulling an all-nighter, I submitted my application and listed this project as my first choice. Finally, on June 26, I received an email confirming that my application had been accepted.</p>\n<h2>Reason for Applying</h2>\n<p>Since my primary programming language is C++, I chose this project from the list of C++ projects. Compared to other projects, I found this one more interesting.</p>\n<p>Initially, I did not know that this was KDE community's first participation in OSPP, nor did I know it was their first and only project. I also wasn't familiar with the KDE community. After learning about the KDE community, I discovered that I really liked their philosophy. The mentor was also very enthusiastic and emphasized the importance of communication multiple times during the application process, providing me with a lot of help.</p>\n<h2>Project Development Plan</h2>\n<p>The project uses QML to port the applications to Android. In simple terms, the process is divided into the following steps:</p>\n<ol>\n<li>Configure the development environment.</li>\n<li>Create a QtQuick project and start the migration:\n<ol>\n<li>Implement the UI.</li>\n<li>Port the logic code.</li>\n</ol>\n</li>\n<li>Package, deploy, and test.</li>\n</ol>\n<p>Currently, I have roughly completed the work of configuring the environment.</p>\n<p>Since I only have a Windows machine at the moment, my solution is to run a Fedora Workstation 40 virtual machine using VirtualBox. In the virtual machine, I use podman and distrobox to set up the KDE development environment with the KDE kdesrc-build tool.</p>\n",
      "date_published": "2024-07-03T00:00:00.000Z",
      "date_modified": "2024-07-16T02:12:24.000Z",
      "authors": [],
      "tags": [
        "OSPP"
      ]
    },
    {
      "title": "About me",
      "url": "https://heeiya.github.io/KDEBlog/posts/%E5%85%B3%E4%BA%8E%E6%88%91.html",
      "id": "https://heeiya.github.io/KDEBlog/posts/%E5%85%B3%E4%BA%8E%E6%88%91.html",
      "summary": "About me\nnothing for now",
      "content_html": "\n<p>nothing for now</p>\n",
      "date_published": "2021-01-01T00:00:00.000Z",
      "date_modified": "2024-07-04T14:24:59.000Z",
      "authors": [],
      "tags": [
        "introduction"
      ]
    }
  ]
}